Revit 2027 API
BuiltInFailures.StairRampFailures.RisersAtSameLocation Property
 The highlighted risers have the same location along the boundary line. Please move one of the two risers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RisersAtSameLocation { get; }
Public Shared ReadOnly Property RisersAtSameLocation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RisersAtSameLocation {
	FailureDefinitionId^ get ();
}
static member RisersAtSameLocation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace